URLShortener/app/models/shortened_url.rb

  def self.prune(n)
    ShortenedUrl
    .joins(:submitter)
    .left_outer_joins(:visits)
    .where("shortened_urls.created_at <= ? AND users.premium = false", n.minutes.ago)
    .group("shortened_urls.id")
    .having("COALESCE(MAX(visits.created_at), ?) <= ?", n.hours.ago, n.minutes.ago)
    .select("shortened_urls.*")
    .destroy_all
---
SELECT shortened_urls.* FROM "shortened_urls" INNER JOIN "users" ON "users"."id" = "shortened_urls"."user_id" LEFT OUTER JOIN "visits" ON "visits"."shortened_url_id" = "shortened_urls"."id" WHERE (shortened_urls.created_at <= '2019-09-27 04:33:42.836650' AND users.premium = false) GROUP BY shortened_urls.id HAVING (COALESCE(MAX(visits.created_at), '2019-09-26 18:43:42.853046') <= '2019-09-27 04:33:42.853061')