URLShortener/app/models/shortened_url.rb

INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "google.com"], ["short_url", "LXrfJfY9nm5ekooH2a0Tkg"], ["user_id", 1], ["created_at", "2019-09-26 21:58:06.430887"], ["updated_at", "2019-09-26 21:58:06.430887"]]
---
  def self.shorten(user, long_url)
    url = ShortenedUrl.new(:user_id => user.id, :long_url => long_url,
    :short_url => ShortenedUrl.random_code)
    url.save!

SELECT 1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "LXrfJfY9nm5ekooH2a0Tkg"], ["LIMIT", 1]]
---
  def self.random_code
    code = nil
    until code
      code = SecureRandom::urlsafe_base64
      code = nil if ShortenedUrl.exists?(:short_url => code)